lfazio/rv32cortex-m/src/platform/stm32f746/main.c
/* ------------------------------------------------------------------ */
/* Diagnostics                                                         */
/* ------------------------------------------------------------------ */

static const char *cause_name(uint32_t mcause)
{
    if (mcause & RV_CAUSE_INTERRUPT) {
        return "interrupt";
    }
    switch (mcause) {
    case RV_EXC_INSN_MISALIGNED:    return "instruction address misaligned";
    case RV_EXC_INSN_ACCESS_FAULT:  return "instruction access fault";
    case RV_EXC_ILLEGAL_INSN:       return "illegal instruction";
    case RV_EXC_BREAKPOINT:         return "breakpoint";
    case RV_EXC_LOAD_MISALIGNED:    return "load address misaligned";
    case RV_EXC_LOAD_ACCESS_FAULT:  return "load access fault";
    case RV_EXC_STORE_MISALIGNED:   return "store address misaligned";
    case RV_EXC_STORE_ACCESS_FAULT: return "store access fault";
    case RV_EXC_ECALL_M:            return "environment call";
    default:                        return "unknown";
    }
}

static void report_state(void)
{
    console_puts("\n-- guest state --\n  pc     ");
    console_puthex(g_hart.pc);

    /*
     * mcause is only meaningful once something has trapped. Decoding it
     * unconditionally reports "instruction address misaligned" for a clean
     * run, because that cause happens to be code 0.
     */
#if RV_ENABLE_STATS
    console_puts("\n  traps  ");
    console_putu(g_hart.trap_count);
    if (g_hart.trap_count == 0u) {
        console_puts("\n  sp     ");
        console_puthex(g_hart.x[2]);
        console_puts("  ra    ");
        console_puthex(g_hart.x[1]);
        console_putc('\n');
        return;
    }
#endif

    console_puts("\n  mcause ");
    console_puthex(g_hart.mcause);
    console_puts("  (");
    console_puts(cause_name(g_hart.mcause));
    console_puts(")\n  mepc   ");
    console_puthex(g_hart.mepc);
    console_puts("  mtval ");
    console_puthex(g_hart.mtval);
    console_puts("\n  sp     ");
    console_puthex(g_hart.x[2]);
    console_puts("  ra    ");
    console_puthex(g_hart.x[1]);
    console_putc('\n');
}

/* ------------------------------------------------------------------ */
/* Entry                                                               */
/* ------------------------------------------------------------------ */

int main(void)
{
    board_init();

#if RV32_NATIVE_COREMARK
    /*
     * Native baseline: the same CoreMark sources compiled for Cortex-M7
     * and run directly, with no emulation, so the interpreter and JIT
     * numbers can be put against something absolute.
     */
    {
        extern int coremark_native_main(void);
        console_puts("\n\nrv32cortex-m: NATIVE CoreMark on ");
        console_puts(board_name());
        console_puts(" @ ");
        console_putu(board_clock_hz() / 1000000u);
        console_puts(" MHz\n\n");
        const uint32_t c0 = board_cycles();
        (void)coremark_native_main();
        console_puts("\n-- native --\n  host     ");
        console_putu(board_cycles() - c0);
        console_puts(" cycles\n");
        for (;;) { __WFI(); }
    }
#endif
    /* Built from the configured extensions rather than hardcoded, so the
     * banner cannot drift from what the core actually implements. */
    console_puts("\n\nrv32cortex-m: RV32I"
#if RV_EXT_M
                 "M"
#endif
#if RV_EXT_A
                 "A"
#endif
#if RV_EXT_F
                 "F"
#endif
#if RV_EXT_C
                 "C"
#endif
/* B is exactly Zba+Zbb+Zbs, and is what misa reports; Zbc is separate. */
#if RV_EXT_ZBA && RV_EXT_ZBB && RV_EXT_ZBS
                 "B"
#endif
#if RV_EXT_ZBC
                 "_zbc"
#endif
                 " on ");
    console_puts(board_name());
    console_puts(" @ ");
    console_putu(board_clock_hz() / 1000000u);
    console_puts(" MHz\n");

    if (!build_address_space()) {
        console_puts("fatal: could not build the guest address space\n");
        fatal_halt();
    }

    rv_hart_init(&g_hart, &g_bus, 0u);
    rv_clint_init(&g_clint, &g_hart);
    rv_aplic_init(&g_aplic, &g_hart);
    rv_aplic_set_eoi(&g_aplic, aplic_unmask_line, NULL);
    bridged_irqs_init();
    rv_uart_init(&g_uart, guest_uart_tx, guest_uart_rx, NULL);
    g_hart.ecall = guest_ecall;
    g_hart.cache = &g_cache_ops;

#if RV_ENABLE_JIT
    rv_jit_set_code_buffer(g_jit_code, sizeof(g_jit_code));
    rv_backend = &rv_backend_jit;
    if (rv_backend->init != NULL && !rv_backend->init(&g_hart)) {
        console_puts("jit init failed; falling back to the interpreter\n");
        rv_backend = &rv_backend_interp;
    }
#endif

    /*
     * The image is linked to run from guest RAM, so copy it out of flash.
     * Guests linked for the ROM window can skip this and reset straight to
     * RV_GUEST_ROM_BASE.
     */
    if (rv_guest_image_size > GUEST_RAM_SIZE) {
        console_puts("fatal: guest image larger than guest RAM\n");
        fatal_halt();
    }
    memcpy(GUEST_RAM_BASE_PTR, rv_guest_image, rv_guest_image_size);

    console_puts("guest  ");
    console_putu(rv_guest_image_size);
    console_puts(" bytes at ");
    console_puthex(RV_GUEST_RESET_PC);
    console_puts("\nram    ");
    console_putu(GUEST_RAM_SIZE / 1024u);
    console_puts(" KiB (");
    console_putu(GUEST_RAM_SIZE);
    console_puts(" bytes)\nbackend ");
    console_puts(rv_backend->name);
    console_puts("\n\n");

    rv_hart_reset(&g_hart, RV_GUEST_RESET_PC);
    rv_hart_boot(&g_hart, RV_GUEST_RAM_BASE, GUEST_RAM_SIZE);

    const uint32_t cycles_per_tick = SystemCoreClock / RV_CLINT_HZ;
    const uint32_t start_cycles = board_cycles();
    uint64_t retired_total = 0;

    for (;;) {
        uint32_t retired = 0;
        const rv_run_reason_t why = rv_run(&g_hart, RV_RUN_SLICE, &retired);
        retired_total += retired;

        /* Guest time tracks real time through the DWT cycle counter. */
        rv_clint_set_time(&g_clint,
                          (uint64_t)(board_cycles() - start_cycles) / cycles_per_tick);

